### Imporing necessary libraries

In [1]:
import csv
import sqlite3

### Creating Employee and Department tables

In [2]:
con = sqlite3.connect("/Users/vivekvanahalli/Desktop/testdb.db") 
cur = con.cursor()
cur.execute("CREATE TABLE employee (id integer PRIMARY KEY autoincrement, first_name VARCHAR(50), last_name VARCHAR(50), salary integer, department_name VARCHAR(50), department_id integer, FOREIGN KEY (department_id) REFERENCES department(id));")
cur.execute("CREATE TABLE department (id integer PRIMARY KEY autoincrement, name VARCHAR(50), salary_increment REAL);")

### Insering values in Department table

In [3]:
cur.execute('INSERT INTO department (name, salary_increment) VALUES("Finance",10), ("IT",15), ("Sales",17), ("Marketing",16);')
con.commit()
cur.execute("select * from department;")
print(cur.fetchall())

[(1, 'Finance', 10.0), (2, 'IT', 15.0), (3, 'Sales', 17.0), (4, 'Marketing', 16.0)]

### Insering values in Employee table

In [4]:
#Loading data from flat_data.csv
with open('/Users/vivekvanahalli/Desktop/My Desktop/flat_data.csv','r') as flatdata:
    dr = csv.DictReader(flatdata) # comma is default delimiter
    to_db = [(i['first_name'], i['last_name'],i['salary'],i['dept_name']) for i in dr]

cur.executemany("INSERT INTO employee (first_name, last_name, salary, department_name) VALUES (?,?,?,?);", to_db)
con.commit()
cur.execute("select * from employee;")
print(cur.fetchall())

[(1, 'Darius', 'Mufutau', 3901, 'Finance', None), (2, 'Tiger', 'Elliott', 5489, 'IT', None), (3, 'Malik', 'Macaulay', 5444, 'Sales', None), (4, 'Ali', 'Vance', 8993, 'Marketing', None), (5, 'Randall', 'Deacon', 9515, 'IT', None), (6, 'Josiah', 'Lee', 8113, 'Sales', None), (7, 'Dante', 'Mohammad', 8446, 'Sales', None), (8, 'Wyatt', 'Kuame', 4817, 'Marketing', None), (9, 'Quinn', 'Oliver', 5513, 'Finance', None), (10, 'Oliver', 'Gary', 5158, 'IT', None), (11, 'Thane', 'Phelan', 4957, 'Sales', None), (12, 'Walter', 'Lester', 3864, 'Finance', None), (13, 'Samson', 'Dolan', 6855, 'IT', None), (14, 'Beck', 'Walker', 7077, 'Sales', None), (15, 'Lucas', 'Marshall', 7499, 'Marketing', None), (16, 'John', 'Nash', 4269, 'IT', None), (17, 'Quinlan', 'Elliott', 7503, 'Sales', None), (18, 'Ivan', 'Dennis', 4048, 'Sales', None), (19, 'Wang', 'Ronan', 9319, 'Marketing', None), (20, 'Stone', 'Jameson', 9354, 'Finance', None), (21, 'Clayton', 'Jarrod', 4102, 'IT', None), (22, 'Cain', 'Sean', 7353, 'Sales', None)]

#### Updating the department id in Employee table with values from Department table

In [5]:
cur.execute("UPDATE employee SET department_id = (SELECT department.id from department WHERE employee.department_name=department.name);")
con.commit()
cur.execute("select * from employee;")
print(cur.fetchall())

[(1, 'Darius', 'Mufutau', 3901, 'Finance', 1), (2, 'Tiger', 'Elliott', 5489, 'IT', 2), (3, 'Malik', 'Macaulay', 5444, 'Sales', 3), (4, 'Ali', 'Vance', 8993, 'Marketing', 4), (5, 'Randall', 'Deacon', 9515, 'IT', 2), (6, 'Josiah', 'Lee', 8113, 'Sales', 3), (7, 'Dante', 'Mohammad', 8446, 'Sales', 3), (8, 'Wyatt', 'Kuame', 4817, 'Marketing', 4), (9, 'Quinn', 'Oliver', 5513, 'Finance', 1), (10, 'Oliver', 'Gary', 5158, 'IT', 2), (11, 'Thane', 'Phelan', 4957, 'Sales', 3), (12, 'Walter', 'Lester', 3864, 'Finance', 1), (13, 'Samson', 'Dolan', 6855, 'IT', 2), (14, 'Beck', 'Walker', 7077, 'Sales', 3), (15, 'Lucas', 'Marshall', 7499, 'Marketing', 4), (16, 'John', 'Nash', 4269, 'IT', 2), (17, 'Quinlan', 'Elliott', 7503, 'Sales', 3), (18, 'Ivan', 'Dennis', 4048, 'Sales', 3), (19, 'Wang', 'Ronan', 9319, 'Marketing', 4), (20, 'Stone', 'Jameson', 9354, 'Finance', 1), (21, 'Clayton', 'Jarrod', 4102, 'IT', 2), (22, 'Cain', 'Sean', 7353, 'Sales', 3)]

### Creating a new table updated_salaries and populating it with employee id and their updated salaries (with increment)

In [6]:
cur.execute("CREATE TABLE updated_salaries (employee_id integer PRIMARY KEY, updated_salary REAL);")
cur.execute("INSERT INTO updated_salaries select e.id, (e.salary+(e.salary*(d.salary_increment/100))) from employee e JOIN department d WHERE e.department_id = d.id;")
con.commit()
cur.execute("SELECT * FROM updated_salaries;")
print(cur.fetchall())
con.close()

[(1, 4291.1), (2, 6312.35), (3, 6369.48), (4, 10431.880000000001), (5, 10942.25), (6, 9492.21), (7, 9881.82), (8, 5587.72), (9, 6064.3), (10, 5931.7), (11, 5799.6900000000005), (12, 4250.4), (13, 7883.25), (14, 8280.09), (15, 8698.84), (16, 4909.35), (17, 8778.51), (18, 4736.16), (19, 10810.04), (20, 10289.4), (21, 4717.3), (22, 8603.01)]